//package Homework6;
//
//public class ProgressionDoWhile {
//
//public static void main(String[] args) {
//
//    System.out.print(Progression(1));
//}
//
//    public static int Progression(int a) {
//    int sum = 0;
//    for (int d = 0; d > 0 ; d++) {
//
//        }
//        return sum;
//    }
//}





//    Написать функцию для вывода на экран арифметической прогрессии.


//    Функция должна принимать в качестве аргумента три параметра:
//        начальное значение 1-го элемента, величину смещения и конечное количество элементов прогрессии.
